#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/imagebuilder/imagebuilder-staging/runs/run-YXjabyPAgty8ZGEh

Waiting for the plan to start...

Terraform v0.14.0
Configuring remote state backend...
Initializing Terraform configuration...
aws_cloudwatch_log_group.internal_composer: Refreshing state... [id=staging_internal]
aws_s3_bucket.imagebuilder_s3: Refreshing state... [id=imagebuilder.service.staging]
aws_iam_user.packer: Refreshing state... [id=packer_staging]
aws_sqs_queue.image_builder_pozorbot: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/933752197999/image-builder-pozorbot-staging]
aws_iam_user.imagebuilder_worker: Refreshing state... [id=imagebuilder_worker_staging]
aws_cloudwatch_log_group.external_composer: Refreshing state... [id=staging_external]
aws_cloudwatch_log_group.pozorbot_cloudwatch_logs: Refreshing state... [id=/aws/lambda/pozorbot_staging]
aws_iam_policy.vmimport_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_s3_staging]
aws_iam_role.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_role.vmimport: Refreshing state... [id=vmimport_staging]
aws_iam_role.spot_fleet_tagging_role: Refreshing state... [id=imagebuilder_spot_fleet_role_staging]
aws_iam_policy.vmimport_ec2: Refreshing state... [id=arn:aws:iam::933752197999:policy/vmimport_ec2_staging]
aws_cloudwatch_log_stream.internal_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_role.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_role.pozorbot_lambda_role: Refreshing state... [id=pozorbot_lambda_role_staging]
aws_iam_policy.packer: Refreshing state... [id=arn:aws:iam::933752197999:policy/packer_staging]
aws_cloudwatch_log_stream.external_composer_syslog: Refreshing state... [id=composer_syslog]
aws_cloudwatch_log_stream.external_worker_syslog: Refreshing state... [id=worker_syslog]
aws_iam_policy.spotfleet_iam_spot_policy: Refreshing state... [id=arn:aws:iam::933752197999:policy/spotfleet_iam_spot_policy_staging]
aws_cloudwatch_log_stream.internal_composer_syslog: Refreshing state... [id=composer_syslog]
aws_iam_policy.pozorbot_lambda_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_sqs_staging]
aws_iam_policy.pozorbot_client_sqs: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_client_sqs_staging]
aws_iam_instance_profile.external_composer: Refreshing state... [id=external_composer_staging]
aws_iam_policy.pozorbot_read_secrets: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_read_secrets_staging]
aws_iam_instance_profile.external_worker: Refreshing state... [id=external_worker_staging]
aws_iam_role_policy_attachment.spotfleet_iam_role_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656385800000003]
aws_iam_role_policy_attachment.vmimport_s3: Refreshing state... [id=vmimport_staging-20210121192044923500000001]
aws_security_group.internal_allow_trusted: Refreshing state... [id=sg-084607083aaa39727]
aws_security_group.internal_allow_egress: Refreshing state... [id=sg-0eb65fd8f2c17dba5]
aws_vpc_endpoint.internal_vpc_s3: Refreshing state... [id=vpce-08d5fdb7cd26e5c94]
aws_iam_instance_profile.internal_worker: Refreshing state... [id=internal_worker_staging]
aws_iam_role_policy_attachment.vmimport_ec2: Refreshing state... [id=vmimport_staging-20210121192045244900000003]
aws_iam_user_policy_attachment.imagebuilder_vmimport: Refreshing state... [id=imagebuilder_worker_staging-20210121192045197600000002]
aws_security_group.external_workers: Refreshing state... [id=sg-0f578bf2872026f5d]
aws_iam_policy.internal_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_composer_read_keys_staging]
aws_vpc_endpoint.external_vpc_s3: Refreshing state... [id=vpce-0249da6b762fae5de]
aws_security_group.external_vpc_endpoints: Refreshing state... [id=sg-0be443e4c92c98b1c]
aws_iam_policy.internal_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_worker_read_keys_staging]
aws_lambda_function.pozorbot_lambda: Refreshing state... [id=pozorbot_staging]
aws_iam_instance_profile.internal_composer: Refreshing state... [id=internal_composer_staging]
aws_iam_policy.pozorbot_lambda_cloudwatch: Refreshing state... [id=arn:aws:iam::933752197999:policy/pozorbot_lambda_cloudwatch_staging]
aws_iam_policy.external_composer_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_composer_read_keys_staging]
aws_iam_policy.external_worker_read_keys: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_worker_read_keys_staging]
aws_iam_user_policy_attachment.packer: Refreshing state... [id=packer_staging-20201204204656365500000001]
aws_iam_role_policy_attachment.spotfleet_iam_spot_policy: Refreshing state... [id=imagebuilder_spot_fleet_role_staging-20201204204656553800000004]
aws_iam_role_policy_attachment.pozorbot_lambda_sqs: Refreshing state... [id=pozorbot_lambda_role_staging-20210127130509124000000001]
aws_iam_role_policy_attachment.internal_pozorbot_composer: Refreshing state... [id=internal_worker_staging-20210127152215241500000004]
aws_iam_role_policy_attachment.internal_pozorbot_worker: Refreshing state... [id=internal_composer_staging-20210127152215216300000001]
aws_iam_role_policy_attachment.external_pozorbot_composer: Refreshing state... [id=external_worker_staging-20210127152215239700000003]
aws_iam_role_policy_attachment.external_pozorbot_worker: Refreshing state... [id=external_composer_staging-20210127152215237300000002]
aws_iam_role_policy_attachment.pozorbot_lambda_secrets: Refreshing state... [id=pozorbot_lambda_role_staging-20210127150546817300000001]
aws_vpc_endpoint.internal_vpc_cloudwatch_logs: Refreshing state... [id=vpce-01e031ba5033ab0c5]
aws_vpc_endpoint.internal_vpc_secretsmanager: Refreshing state... [id=vpce-0d13154306549b1cd]
aws_security_group.external_composer: Refreshing state... [id=sg-0be4cfbfac3cc0022]
aws_iam_role_policy_attachment.internal_composer_read_keys: Refreshing state... [id=internal_composer_staging-20201204204656559200000005]
aws_vpc_endpoint.external_vpc_cloudwatch_logs: Refreshing state... [id=vpce-0ffb71834c608a4e5]
aws_vpc_endpoint.external_vpc_secretsmanager: Refreshing state... [id=vpce-013676c2939c3d681]
aws_iam_policy.external_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/external_cloudwatch_logging_staging]
aws_iam_policy.internal_cloudwatch_logging: Refreshing state... [id=arn:aws:iam::933752197999:policy/internal_cloudwatch_logging_staging]
aws_iam_role_policy_attachment.internal_worker_read_keys: Refreshing state... [id=internal_worker_staging-20201204204656366800000002]
aws_iam_role_policy_attachment.external_composer_read_keys: Refreshing state... [id=external_composer_staging-20210113202541907800000001]
aws_iam_role_policy_attachment.pozorbot_lambda_cloudwatch: Refreshing state... [id=pozorbot_lambda_role_staging-20210127132820714600000001]
aws_iam_role_policy_attachment.external_worker_read_keys: Refreshing state... [id=external_worker_staging-20210113202541913700000002]
aws_lambda_event_source_mapping.pozorbot_sqs: Refreshing state... [id=7ae0421e-5c59-4b9e-971a-aab448662f51]
aws_network_interface.composer_internal: Refreshing state... [id=eni-07088640399f60f49]
aws_ebs_volume.composer_internal: Refreshing state... [id=vol-058d1cec56397f102]
aws_ebs_volume.composer_external: Refreshing state... [id=vol-0daeecfc25da04a05]
aws_network_interface.composer_external: Refreshing state... [id=eni-02f250427cdd85dc7]
aws_iam_role_policy_attachment.external_cloudwatch_worker: Refreshing state... [id=external_composer_staging-20210113203644029600000002]
aws_iam_role_policy_attachment.external_cloudwatch_composer: Refreshing state... [id=external_worker_staging-20210113203644009900000001]
aws_iam_policy.imagebuilder_workers_s3: Refreshing state... [id=arn:aws:iam::933752197999:policy/imagebuilder_workers_s3_staging]
aws_iam_role_policy_attachment.internal_cloudwatch_worker: Refreshing state... [id=internal_composer_staging-2020120420465704340000000a]
aws_iam_role_policy_attachment.internal_cloudwatch_composer: Refreshing state... [id=internal_worker_staging-2020120420465704850000000b]
aws_iam_user_policy_attachment.imagebuilder_s3: Refreshing state... [id=imagebuilder_worker_staging-2020120420465705150000000c]
aws_instance.composer_internal: Refreshing state... [id=i-01fb4a58c2d9fdd24]
aws_eip.lb: Refreshing state... [id=eipalloc-0f8be222c563c4767]
aws_instance.composer_external: Refreshing state... [id=i-051f017fb12db6ba5]
aws_volume_attachment.composer_internal: Refreshing state... [id=vai-3248351]
aws_launch_template.worker_internal_x86: Refreshing state... [id=lt-0a23e96f3feb1649c]
aws_volume_attachment.composer_external: Refreshing state... [id=vai-3730480781]
aws_launch_template.worker_external_x86: Refreshing state... [id=lt-0195b4ef20679c780]
aws_spot_fleet_request.workers_internal_x86: Refreshing state... [id=sfr-b89308b8-c006-476d-9c54-514af2cfd8d6]
aws_spot_fleet_request.workers_external_x86: Refreshing state... [id=sfr-369361e8-dd7a-4acd-9429-9054b7010805]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_launch_template.worker_external_x86 will be updated in-place
  ~ resource "aws_launch_template" "worker_external_x86" {
      ~ default_version         = 9 -> (known after apply)
        id                      = "lt-0195b4ef20679c780"
      ~ latest_version          = 9 -> (known after apply)
        name                    = "imagebuilder_worker_external_x86_staging"
        tags                    = {
            "AppCode"      = "IMGB-001"
            "Name"         = "🔧 External Composer Worker (staging)"
            "ServiceOwner" = "Image Builder"
        }
      ~ user_data               = "H4sIAAAAAAAA/9R52XLqSJ73PRH1DvlR/qK644xAC2Djblc0AolVArQCPR1EKpUgodRiKcV2+rzI3MztPN48woQE+GCfU9XLdMRE+cZW5n/LX/7XdDeOKI4oY5wS/AzCnFA/gSmth/4Ru38ATpxHLkxPL1VlqEji1FR7HW1ZrRRfjIXTzI+jZ8DV2B8qP1QY5p7oh8pNds/PkjjzaUkLKYXIC3FE/wA2PsERDPFL1Y98WkObbfUrl5HCKNvglJEiFLt+tH0Gj45P7whKkyk+0joice4yKI42/vaHiuKH+BvjfrynqVTyDKfZcwUABhQWPAOMeKZYrAAAQJZ5a5hTL079M3bXAT6VtMUPA6pZ5jFpBkGn0+mIgnqGXe6EeKn47HXmHbHT6XQ78+5xt5GHQ9LfdKO2j8jgFNqpJKaGyZNJiwZ63+Bw8uh2Z+cDt1u27Mibk9lCSfAs9dWjuiD9J2RP23VNTkSXPbflg3r6FGy2XnuTn9Rloz38pMDW9GRY4rbpqbF83GiLftMfUFTX5yRyJNkfJ3rQIH4SN+YrKtJw23ndBnqn1Tt7p63TyptK2z8aw2PDFne5rrD9xfys7hK8Ofl2/ikbap883kznwbgj5vlwOXfSHfkke1YIJ/t0fzKmfJ5N6T5aijvPmR1O00fenu1gMnbrbc+ArzOJO8inlinz0QI1ZtsDu/XnTivzHdk4P6oGPtpCc95+ek3mU1tZjlGyXaVEh4PBeKUrHj1PHxV3lU4nsrmIda6DO6fG1qNITaeiQZymvp89Cucz+ypqMo+608aUPSTNw+F15u0PfEQdITEmM+piOvpkNdn5LEqixUnXo1XCn+UDwjznLI6tx8hrk8ibpKvtDj+ieB7NOvKxjojQkvTRaevnMyQePgXc0zInS2VhvkKRBofRJNB2vWRnLHjcVEZcK+49ZqMBatTtZnDaTPauklme+8p1F4O+ZU2Tc7x12HbTWvqstpCTaKXVOWxtu3Xtk22d6HKzfGLTjTVFbifm+6tNNGqel5q5GI3ayiqA0fEoSI/m1A+kkdrOzB3PsudW93Rih5vhq+GMOLG5edy4AkRaOmn00NJ05WGdE0+q3ZK53SNa+Z3+dDRWnfNCZg2Bbp6OLObmLy8ghLs4/VOKXQ/SGorD6nt/xy7fbHLt0ue7F58nq96QUw2pWawNZyK3k0kjacmG6B8HRuswDVqLp2hXXz3ieKbOpbrCHsaNp+YYxE7uQv+dssoh9SleFxnhGpYJpN4zqNMwuYT3usgR6z1Ms9IydMkCz+CvV0OnumgOJ711d6ooQ+PlSUBw88SyuMk3+YbT4Bqbx03T2TQhZl0BtTkePbW5Nn/l7k6V2VSXtBv746aJhZbrthtPXJPdQNRwWKEltFDLFdqO89jCPH7i3M1H5Z11V9KMl4nO0onOdTXTHRm+2NOskambq9GclU2t3GNpN+BGuqlJlqT25vZqsWJlQTdH4oolltlT5wq/PKuW2DeDJufwKxaHStPoBbzW90yH10SX1TTbTCYOl4zgYLUzAlnTzMN4TmTRZVevmmWp84AM5oZsaaYsuOzRV9hmspLdDHFJT12sdo6tCnrf2xkB9zpfuDNLslqGpa2wyUmWoS5gX50ai0R0D0mx13i3F8gLwxppLmtFtqnZpiVLmiSzbqic9J3sWYKXGn22ia2kNWdV0WSJoMnySg/o3g5I7IbqtFvaPOqapiyteFc2JVkqae12r/ieB7I6j8TUtuSlbqnK8uxNbDtRTYtEOBK1qamKCjeaKKE71HricbmQz+5uO15ao50VKLxKlOYq8I6aaR6hebRs6UlQeiMN76wz5JNYEZKjMSADc+cJJlnuJ7w6UuzhEe1EC1uJsWSPUOGQYFnJaX6IWbWnhUshPhsL0nBktWVx1srkxGgekAnsu+J0IFNEEl2x2+HS1k54YOlGl56dYCXpNm0oAkqXZ3m8sqxcCdVMkd2kSyzW7o0GGrfqacRVDV7erwIttWWrp0XWRB+4Y9N2+8ZAO+uSCm1bDV3i2rqcQDVoNFzWPShEhrYxbC7PHucsxFfF6oxNaZXZktJY9WVoSJxny8TXDFHVF5qtSOpQj0RBY8lhGZHcsYjpdOlZiyze6Wl7q8+d8CDe44XXQpLGWwE3Q4E8cuZJw+EzARGLWgMr0PqWbHKjrsG7omJSbmlyujWwPH0has55FDjC6jg+d45auDzPzcbJMlXRZS1xbstTS+L62sIdmhaRumSlK1K7OydE1oJYWBmrpSIEh1W/nSG9PV6SVbIMSOLyWm5ynVQNuO5UckXFsgJ94Wq2yXWXptzXdy5RyfaMDTFw+MP4F3jFG6+2cOW53xZMc6XOTa47t5eN78fV8c1H59tE1KKEV3lCdBY1HTmZoGB4MmwOQkk+6hJRsH30DIHYyECCdiZdwxqZWqQe7MhklcFQ0DhNWLJa7IZbTjPVvS7Lfjc8pq4hLlWzvVyxGm8P1C7qt/v6YMQrEp3p9tFQOWusLJYHtZ/tdUIie4BSp5+Y1kDZTxfJwdl5uhUeKRqYe43lZoZhjk17NDC7dAp3FkRnK9TY1QJKDcEwhpxpU2vaG42dgUf0QM7MhTec88ee2bcaZqCqS0NuqouOYPWb0bQnTnTistgS59N5wpq8q86jjqBalr6yn1jVNBumlJz0qHOGA7JX5VFjao00jacnbKu6vnDDeeDxUPBUPVzliFcEW2/zqk04bedRLHGt7k5ll0HcHLNJUzNlTh/Ex2XgcshUl2NBHpuWZrrdtuaclyc3cBdLM2ia3GqyJEpjaXnK/DyaqpG8g/boiHZmY7XTJD2Yj/VIzQz9SUADtYl28l5daOwyGOUqCbj5Qml3/UtO1symNJRU2STaSAtIb25p8iWXs+OPlWIw1Y0XfKQ4jSCpZRRu/WhbVLMkznBaizMn94lbi9PtR85Or6dJuv7CPfI1gau1GjWOu9LYU20saWtdn6zH0lJfdzT1BabRMzxkzxlGKaZZCCO4xelznjEYZpThntuC8NjkufZju92+Uj07KT6UjSvzKJsYk6t83RT1rjacGcOpulY6aqd/rXkdtffPK8tyJ0OpnxQtPnNlYVAchjBymWC+JHH7pn+pG5JSYqd2FGk90yR5uHi5osfc4GQOcRpcm/E74HpD7aWOKapfwWVuaN+kS11NMvS3g0lqbzYdqsba1CYvHqVJ9lyvvz9Z7e1kNRjCcxzBQ1ZcYv2+Cfmeym8WajQOyfd7kz8H8c7/y/UDEhIfsLt24xD6UQZewJ9BlWIY3rtM9d9A1cudWnGNH9cv2Hy7BW4aEAQvoPp9qxFkUEprCS6arqt1F4H/sH3/Mjs+IB3GkU9T9H0ofwRKsQ0ug1yewsLnwCZOwTCEWwzEQg1OgR+Bjq3X3rh6Mcqewc0HwlJHec/lX3U3RnkxlJbiLms1j4ak8iag62EUALzH6QkILMgwiiM3AzByAYm3gMYgO2Uk3t5UZpgCF+IwjoDA3q0VxBfKr7I7BeQAIoSzDOx9WAyggOZRhEkpGGNAPQzC28mzmOB7PcWxXJDEKQX8E8cXRl13i588wwC6bloIJzGCxIszercPL9rd0I+eSxVfDbNw6m9OgHqQggP+KcUgiinAkPrRtuC7mIXDOD2BOCq//CijMEJv9nUHUnd8jXvwUAT+m2p/c+PNs+LufgaPzf9/Z1hxq02ATojg7G6ZejgC+IgRqOdZWi+PVHf8qJ7E5zh1YrqGBKd3p5CiLE8vEKZxTMt3h+yUURwCP4t+omCTE/LeXnk4ka42lyyzjjEA9XvLswQi/Gb4E/ut4dQP39l98KnnR4D7Vxzp4o1X3/A34IABghFIMUQeQG5U+zpcfY0BdWpIvws9eHJx9PtnYGNw8AkBkBzgKQNbTAEEDVYAHk4xcDCChefEG4CIjyMKEE5p9h6m4jpB6mGyRm4E7KExANfi9sGIe+Q20Cf43kETP9r+E2D8qsgiFhoN4X4pjWmMYnJJAncbGYU0L/JcgxU+XBfIMgLisq5l4DPodorpbigPux1DKlzkmrFSLwvrCNYv52VynBSJDXz5pw71lgv/5uG/TY7/ryR1YOa9XbqOIxeUPFnhLzcxtff59KcM4Gjvp3FUZEGwh6kPHYIzAFMMbskRu6VrPL+x/sPp9EdJtYbaVFUk1bg589yUTOldhX7NcY4/lOP7tqPuF6mecS6pnrkdibl2EVe5iqTrnb70Uv3v//yP/wIPylQdGuti2jbK+Lwu6JJmDbtSkb2uK6VPQ3r77HUM6fYYokm6OTFeHn4HDxnIXjOQ4chlQpyVWYBhSsOZPCXg4e1UgLkRME7snkD14WpY9fdXqRh5MXi4yK58LIZ7jGicXn/9WouRxXmKcFbbxXnRQbm3IkxPCS7K8G39dhZ8RCR38TqPfFoW+epVR4bTvY9w9S9v/UHmR0FWi3P6USY8ZOvyceYAKfLWJN5mN/F+lOT02jy8qX7rDHDkJrEf0ULI7dYL7l/sxm5it2mcJ+sIhqX+64Wvb23jjSqjKYbhG9mlUVlfqu7b+a/PyjUUuxiVCGVxVK1U0jxCoXt5hEJeGLvg0/HvCNoLKfvIsh+7GAZcig2iBOCoCCvAMFF8uNbzC+y/8n7+j7yEH5nMw4RcuvFfegq/yxJF98DgPAaJn+Aii1YufvT9h7fKj6CP6bsyD4a9WmWo6kZH7UrrYe/l4XeoCABmkpXp4ble51rtGt9s1K6/6wRSnNF6iClkXEhh/SaL8d3fFzo6WYbDAqaiUSkusVaRzcnkbWp4qT58/v4g8YV5+HxnzJdqIW6WFp4W5xfDI3y4k1vGXlXHtOxork3BbbvIlw+f36n+UitF6lcUPjDUKre/irvOMGXeRD28E/PbuO0rOJfhzikAert1GgNtoF7A0PDWzyhO3/tFWT4LmsqH2Clz57sZrGg9mMsSs4ckx+Dfi7BhblniklE//9p09+XKcpXiuwX935h1v4C/gt0rYFJQrekln05TP9pWwc8XQO7H2vXV1vV1rK0V2aJyY/81yurfKQz8FZSXlIaA2fy9BlS+N3pf/8kGGAbmNP4t+VoPJyQ+gQCfsrJIXzJ3dvGz62bhZbcxEnQ7ZVvqb3wEKa5VHJjhVgMwLmDAH//4R/Dw+cPT/BfwM3j4fP+i8OVuFv0lNQE+lZPeO13/V379nTeiv+nK1xJYAPvec79uVL9PeXHLN1C/Re/CwAT4VCL4QTBK6f9S8O1q7uLim9P89ly87BGK6vAdRy+qS57ckVR+BMa0N30/u0UYu0UeRnG0x2lRj/yyw++pOihKbAoOxcxxwIDAPEJerYIgLYOieof0dVz7co9+UaW+VMHPP9+b8BuC+FbO8+SKK7j2tFd8ZylOirnm46PUTxlIcRhT/JGtjP0sRgEuBuBf6OZu0i4iri+Yf/oI6/PTI8t+AybD/FD5nwAAAP//0sOfl4shAAA=" -> "H4sIAAAAAAAA/9RZ2ZLqyJm+J6LfIYeuibbjjEALUEXZ1WEEEqsEaAU8DiKVSpBQaikpxXZ8XmRu5nYebx5hQiCqqTqn227bERNdN1XK/Lf88l+zunFEcUQZ45TgZxDmhPoJTGk99I/Y/QNw4jxyYXp6qSpDRRKnptrraMtqpfhiLJxmfhw9A67Gflf5rsIw90TfVW6ye36WxJlPL7SQUoi8EEf0D2DjExzBEL9U/cinNbTZVn/iMlIYZRucMlKEYtePts/g0fHpHcHFZIqPtI5InLsMiqONv/2uovgh/sq47+9pKpU8w2n2XAGAAYUFzwAjnikWKwAAkGXeGubUi1P/jN11gE8X2uKHAdUs85g0g6DT6XREQT3DLndCvFR89jrzjtjpdLqdefe428jDIelvulHbR2RwCu1UElPD5MmkRQO9b3A4eXS7s/OB2y1bduTNyWyhJHiW+upRXZD+E7Kn7bomJ6LLntvyQT19CjZbr73JT+qy0R5+UmBrejIscdv01Fg+brRFv+kPKKrrcxI5kuyPEz1oED+JG/MVFWm47bxuA73T6p2909Zp5U2l7R+N4bFhi7tcV9j+Yn5WdwnenHw7/5QNtU8eb6bzYNwR83y4nDvpjnySPSuEk326PxlTPs+mdB8txZ3nzA6n6SNvz3YwGbv1tmfA15nEHeRTy5T5aIEas+2B3fpzp5X5jmycH1UDH22hOW8/vSbzqa0sxyjZrlKiw8FgvNIVj56nj4q7SqcT2VzEOtfBnVNj61GkplPRIE5T388ehfOZfRU1mUfdaWPKHpLm4fA68/YHPqKOkBiTGXUxHX2ymux8FiXR4qTr0Srhz/IBYZ5zFsfWY+S1SeRN0tV2hx9RPI9mHflYR0RoSfrotPXzGRIPnwLuaZmTpbIwX6FIg8NoEmi7XrIzFjxuKiOuFfces9EANep2MzhtJntXySzPfeW6i0HfsqbJOd46bLtpLX1WW8hJtNLqHLa23br2ybZOdLlZPrHpxpoitxPz/dUmGjXPS81cjEZtZRXA6HgUpEdz6gfSSG1n5o5n2XOrezqxw83w1XBGnNjcPG5cASItnTR6aGm68rDOiSfVbsnc7hGt/E5/Ohqrznkhs4ZAN09HFnPzlxcQwl2c/inFrgdpDcVh9b2/Y5dvNrn2xee7V58nq96QUw2pWawNZyK3k0kjacmG6B8HRuswDVqLp2hXXz3ieKbOpbrCHsaNp+YYxE7uQv+dssoh9SleFxmhDMsEUu8Z1GmYXMN7XeSI9R6m2cUydM0Cz+CvpaFTXTSHk966O1WUofHyJCC4eWJZ3OSbfMNpcI3N46bpbJoQs66A2hyPntpcmy+5u1NlNtUl7cb+uGlioeW67cYT12Q3EDUcVmgJLdRyhbbjPLYwj584d/NReWfdlTTjZaKzdKJzXc10R4Yv9jRrZOrmajRnZVO77LG0G3Aj3dQkS1J7c3u1WLGyoJsjccUSy+ypc4VfnlVL7JtBk3P4FYtDpWn0Al7re6bDa6LLapptJhOHS0ZwsNoZgaxp5mE8J7LosqtXzbLUeUAGc0O2NFMWXPboK2wzWcluhrikpy5WO8dWBb3v7YyAe50v3JklWS3D0lbY5CTLUBewr06NRSK6h6TYa7zbC+SFYY00l7Ui29Rs05IlTZJZN1RO+k72LMFLjT7bxFbSmrOqaLJE0GR5pQd0bwckdkN12r3YPOqapiyteFc2JVm60NrtXvE9D2R1HompbclL3VKV5dmb2HaimhaJcCRqU1MVFW40UUJ3qPXE43Ihn93ddry0RjsrUHiVKM1V4B010zxC82jZ0pOg9EYa3llnyCexIiRHY0AG5s4TTLLcT3h1pNjDI9qJFrYSY8keocIhwbKS0/wQs2pPC5dCfDYWpOHIasvirJXJidE8IBPYd8XpQKaIJLpit8OlrZ3wwNKNLj07wUrSbdpQBJQuz/J4ZVm5EqqZIrtJl1is3RsNNG7V04irGry8XwVaastWT4usiT5wx6bt9o2BdtYlFdq2GrrEtXU5gWrQaLise1CIDG1j2FyePc5ZiK+K1Rmb0iqzJaWx6svQkDjPlomvGaKqLzRbkdShHomCxpLDMiK5YxHT6dKzFlm809P2Vp874UG8xwuvhSSNtwJuhgJ55MyThsNnAiIWtQZWoPUt2eRGXYN3RcWk3NLkdGtgefpC1JzzKHCE1XF87hy1cHmem42TZaqiy1ri3JanlsT1tYU7NC0idclKV6R2d06IrAWxsDJWS0UIDqt+O0N6e7wkq2QZkMTltdzkOqkacN2p5IqKZQX6wtVsk+suTbmv71yiku0ZG2Lg8Ifxz/CKN15t4cpzvy2Y5kqdm1x3bi8b346r45uPzreJqEUJr/KE6CxqOnIyQcHwZNgchJJ81CWiYPvoGQKxkYEE7Uy6hjUytUg92JHJKoOhoHGasGS12A23nGaqe12W/W54TF1DXKpme7liNd4eqF3Ub/f1wYhXJDrT7aOhctZYWSwPaj/b64RE9gClTj8xrYGyny6Sg7PzdCs8UjQw9xrLzQzDHJv2aGB26RTuLIjOVqixqwWUGoJhDDnTpta0Nxo7A4/ogZyZC2845489s281zEBVl4bcVBcdweo3o2lPnOjEZbElzqfzhDV5V51HHUG1LH1lP7GqaTZMKTnpUecMB2SvyqPG1BppGk9P2FZ1feGG88DjoeCperjKEa8Itt7mVZtw2s6jWOJa3Z3KLoO4OWaTpmbKnD6Ij8vA5ZCpLseCPDYtzXS7bc05L09u4C6WZtA0udVkSZTG0vKU+Xk0VSN5B+3REe3MxmqnSXowH+uRmhn6k4AGahPt5L260NhlMMpVEnDzhdLu+tecrJlNaSipskm0kRaQ3tzS5GsuZ8cfK8Vgqhsv+EhxGkFSyyjc+tG2qGZJnOG0FmdO7hO3Fqfbj5ydXk+TdP2Fe+RrAldrNWocV9LYU20saWtdn6zH0lJfdzT1BabRMzxkzxlGKaZZCCO4xelznjEYZpThntuC8NjkufZju90uqZ4znO59hC+9KzPk+4Idlyp0U9S72nBmDKfqWumonX5Z9jpq75/QlzsZSv2k6PKZkoVBcRjCyGWC+ZLE7Zv+pW5IygU+taNI65kmycPFSwkgc0OUOcRpUPbjd9j1htpLHVNUL/FlboDfpEtdTTL0t4NJam82HarG2tQmLx6lSfZcr78/We3tZDUYwnMcwUNW3GP9vg/5lsqvFmo0Dsm325M/B/HO/0v5AQmJD9hdu3EI/SgDL+DPoEoxDO+9pvofoOrlTs1J8eHj+hWbr7fATQOC4AVUv201ggxKaS3BRd9VWncV+Kvt+5fZ8QHpMI58mqJvQ/k9UIptcJ3l8hQWPgc2cQqGIdxiIBZqcAr8CHRsvfbG1YtR9gxuPhBedFzu+fJX3Y1RXsylF3HXtZpHQ1J5E9D1MAoA3uP0BAQWZBjFkZsBGLmAxFtAY5CdMhJvbyozTIELcRhHQGDv1griK+VPsjsF5AAihLMM7H1YzKCA5lGEyUUwxoB6GIS3k2cxwfd6imO5IIlTCvgnji+MKneLnzzDALpuWggnMYLEizN6tw+v2t3Qj54vKn4yzMKpvzkB6kEKDviHFIMopgBD6kfbgu9qFg7j9ATi6PLlRxmFEXqzrzuQuuMy7sFDEfhvqv3NjTfPirv7ETw2//3OsOJWmwCdEMHZ3TL1cATwESNQz7O0fjlS3fGjehKf49SJ6RoSnN6dQoqyPL1CmMYxvTw9ZKeM4hD4WfQDBZuckPf2ysOJVNp8YZl1jAGo31ueJRDhN8Of2K8Np374zu6DTz0/Aty/4khXbyx9w9+AAwYIRiDFEHkAuVHtp/nqpxhQp4b0u9CDJxdHv38GNgYHnxAAyQGeMrDFFEDQYAXg4RQDByNYeE68AYj4OKIA4ZRm72EqrhOkHiZr5EbAHhoDUNa3D0bcI7eBPsH3Dpr40fYfAOMXRRax0GgI90tpTGMUk2sSuNvIKKR5kecarPDhukCWERBf6loGPoNupxjwhvKw2zGkwkXKjJV6WVhHsH49L5PjpEhs4Ms/dKi3XPg3D/91cvy3C6kDM+/t0nUcueDCkxX+chNTe59Pf8gAjvZ+GkdFFgR7mPrQITgDMMXglhyxe3GN5zfWX51Ov5dUa6hNVUVSjZszz03JlN5V6Ncc5/hDOb5vO+p+keoZ55rqmduRmLKLKOUqkq53+tJL9X//+7/+BzwoU3VorIuB27jEZ7mgS5o17EpF9ipXLj4N6e2z1zGk23uIJunmxHh5+B08ZCB7zUCGI5cJcXbJAgxzMZzJUwIe3k4FmBsB48TuCVQfSsOqvy+lYuTF4OEqu/KxGO4xonFa/vqlFiOL8xThrLaL86KDcm9FmJ4SXJTh2/rtLPiISO7idR759FLkq6WOsnms/uWtP8j8KMhqcU4/yoSHbH15nzlAirw1ibfZTbwfJTktm4c31W+dAY7cJPYjWgi53XrB/bPd2E3sNo3zZB3B8KK/vPD1rW28UWU0xTB8I7s2Kutr1X07f/myXEOxi9EFoSyOqpVKmkcodK/vUMgLYxd8Ov4dQXslZR9Z9mMXw4BrsUGUABwVYQUYJooPZT2/wv4LT+i/5jH8yGQeJuTajf/ca/hdlii6BwbnMUj8BBdZtHL1o2+/vVW+B31M35V5MOzVKkNVNzpqV1oPey8Pv0NFADCT7JIenut1rtWu8c1GrfxdJ5DijNZDTCHjQgrrN1mM7/6+0NHJMhwWMBWNSnGJtYpsTiZvU8NL9eHztweJL8zD5ztjvlQLcbO08LQ4vxoe4cOd3EvsVXVMLx1N2RTctot8+fD5neovtYtIvUThA0OtcvuruOsMU+ZN1MM7Mb+N2y7BuQ53TgHQ263TGGgD9QqGhrd+RnH63i8u5bOgqXyInUvufDeDFa0Hc11i9pDkGPxnETbMLUtcM+rnX5ruvpQspRTfLej/xqz7BfwV7F4Bk4JqTb/w6TT1o20V/HgF5H6sXZe2rsuxtlZki8qN/Zcoq3+nMPBXcLmkNATM5u81oPKt0bv8PxtgGJjT+Lfkaz2ckPgEAnzKLkX6mrmzq5+Vm4WX3cZI0O1c2lJ/4yNIca3iwAy3GoBxAQP++Mc/gofPH17nv4AfwcPn+xeFL3ez6M+pCfDpMum90/X/5dffeCb6m65clsAC2Pee+9NG9duUV7d8A/Vr9K4MTIBPFwQ/CEYp/ScF367mLi6+Os1vz8UvPUJRHb7h6EV1yZM7ksr3wJj2pu9ntwhjt8jDKI72OC3qkX/p8HuqDooSm4JDMXMcMCAwj5BXqyBIL0FRvUO6HNe+3KNfVKkvVfDjj/cm/IYgvpXzPClxBWVPW+I7S3FSzDUfH6V+yECKw5jij2yX2M9iFOBiAP6Zbu4m7SqifMH800dYn58eWfYrMBnmu8r/BQAA//9Y6a1NjiEAAA=="
        # (8 unchanged attributes hidden)



        # (4 unchanged blocks hidden)
    }

  # aws_spot_fleet_request.workers_external_x86 must be replaced
-/+ resource "aws_spot_fleet_request" "workers_external_x86" {
      ~ client_token                        = "terraform-20210201141322734500000002" -> (known after apply)
      ~ id                                  = "sfr-369361e8-dd7a-4acd-9429-9054b7010805" -> (known after apply)
      ~ load_balancers                      = [] -> (known after apply)
      ~ spot_request_state                  = "active" -> (known after apply)
        tags                                = {
            "AppCode"      = "IMGB-001"
            "Name"         = "External worker fleet - staging"
            "ServiceOwner" = "Image Builder"
        }
      ~ target_group_arns                   = [] -> (known after apply)
        # (10 unchanged attributes hidden)

      - launch_template_config { # forces replacement
          - launch_template_specification {
              - id      = "lt-0195b4ef20679c780" -> null
              - version = "9" -> null
            }

          - overrides {
              - instance_type     = "c5.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5a.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.large" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
          - overrides {
              - instance_type     = "c5d.xlarge" -> null
              - priority          = 0 -> null
              - subnet_id         = "subnet-0c016a02" -> null
              - weighted_capacity = 0 -> null
            }
        }
      + launch_template_config { # forces replacement
          + launch_template_specification {
              + id      = "lt-0195b4ef20679c780"
              + version = (known after apply)
            }

          + overrides {
              + instance_type     = "c5.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5a.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.large"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
          + overrides {
              + instance_type     = "c5d.xlarge"
              + priority          = (known after apply)
              + spot_price        = (known after apply)
              + subnet_id         = "subnet-0c016a02"
              + weighted_capacity = (known after apply)
            }
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.
```

</details>

*Pusher: @ondrejbudai, Action: `pull_request`*